const { float_point_array, data_string, hex_to_buffer, hex_to_ten_array } = require('./tools')
// flv文件解析
// -- headers部分的解析 --
// 1. signature 3个字节，一般是 FLV，表明这是flv文件
// 2. version 1个字节，可以看见是 01
// 3. flags 1个字节，可以看见是 05，05就是ox05,也就是 00000101,倒数第一位是video位，倒数第三位是audio位，0表示没有，1表示有
// 这里的意思就是 既有视频也有音频
// 4. dataoffset 4个字节，表示flv的header长度，这里固定是9
// -- body部分的解析 --
// ** flv的body部分有一系列的back-pointers和tag构成 **
// 1. back-pointers 4个字节，可以看到时 00 00 00 00
// tag分三种类型：video，audio，scripts
// tag的组成：type, tag data size, Timestamp, TimestampExtended, stream id, tag data
// 2. type 1个字节，8为audio，9为video，18为scripts，可以看见是12，而 12 = 16 + 2 = 18， 因此为 scripts
// 3. tag data size 3个字节，表示tag data的长度，可以看见是 00 06 15，因此长度为 6*16*16 + 16 + 5 = 1557
// 4. Timestamp 3个字节，时间戳，可以看见是 00 00 00，因为是 scripts，所以是0
// 5. TimestampExtended 1个字节，时间戳扩展字段，可以看见是 00，因此为0
// 6. stream id 3个字节，一般为 00 00 00，因此一般是0
// 7. tag data
// -- tag的内容 --
// 第一个AMF包封装字符串类型数据，用来装入一个“onMetaData”标志
// 1. type 数据类型1个字节，可以看见是 02，对应的就是 String，而string后面的2个字节是数据的长度
// 2. size 因为数据类型是 string，因此是2个字节，可以看见是 00 0a，因此数据长度为 10
// 3. value 可以i 看见是 "6f","6e","4d","65","74","61","44","61","74","61" 即 onMetaData
var array = ["6f","6e","4d","65","74","61","44","61","74","61"]

// 第二个AMF包封装一个数组类型，这个数组中包含了音视频信息项的名称和值
// 1. type 数据类型1个字节，可以看见是 08，对应的是 ECMA array type
// 2. size 键值对的个数 4个字节，可以看见是 00 00 00 19，因为有 16 + 9 = 25 个键值对
// 3. key 键，2个字节，可以看到是 "00","0f" 即 00 0f，长度为 15 , 即 metadatacreator
array = ["6d","65","74","61","64","61","74","61","63","72","65","61","74","6f","72"]
// 4. value 后面的3个字节，是 "02","00","33" ，即 02 00 33，02对应的是 String，后面2个字节为长度 3*16 + 3 = 51
// 值为 Yet Another Metadata Injector for FLV - Version 1.8
array = ["59","65","74","20","41","6e","6f","74","68","65",
"72","20","4d","65","74","61","64","61","74","61",
"20","49","6e","6a","65","63","74","6f","72","20",
"66","6f","72","20","46","4c","56","20","2d","20",
"56","65","72","73","69","6f","6e","20","31","2e",
"38"]
// 此时键值对是 metadatacreator: Yet Another Metadata Injector for FLV - Version 1.8
// -- 以此类推 --
// - key ，00 0c，00对于的是 0c = 12，对应的键是 hasKeyframes
array = ["68","61","73","4b","65","79","66","72","61","6d",
"65","73"]
// - value 可以看见是 01，因此是boolean类型，只为 01，即 true
// 此时键值对是 hasKeyframes: true
// - key 00 08,长度为 8，因此键为 hasVideo
// - value 01 01，即 true
// 此时键值对是 hasVideo: true
array = ["68","61","73","56","69","64","65","6f"]
// - key 00 08,长度为 8，因此键为 hasAudio
// - value 01 01，即 true
// 此时键值对是 hasAudio: true
array = ["68","61","73","41","75","64","69","6f"]
// - key 00 0b,长度为 11，因此键为 hasMetadata
// - value 01 01，即 true
// 此时键值对是 hasMetadata: true
array = ["68","61","73","4d","65","74","61","64","61","74",
"61"]
// - key 00 0c,长度为 12，因此键为 canSeekToEnd
// - value 01 01，即 true
// 此时键值对是 canSeekToEnd: true
array = ["63","61","6e","53","65","65","6b","54","6f","45",
"6e","64"]
// - key 00 08,长度为 8，因此键为 duration // 3:30 = 3*60 + 30 = 180 + 30 = 210
// - value 00，8个字节 即 "40","6a","3e","b0","20","c4","9b","a6" 即 09.959
// 此时键值对是 duration: 09.959
array = ["64","75","72","61","74","69","6f","6e"]
array = ["40","6a","3e","b0","20","c4","9b","a6"]
// - key 00 08,长度为 8，因此键为 datasize
// - value 00，8个字节 即 "41","80","7b","4f","f0","00","00","00" 即 34564606
// 此时键值对是 datasize: 34564606
array = ["64","61","74","61","73","69","7a","65"]
array = ["41","80","7b","4f","f0","00","00","00"]
// - key 00 09 9个字节，即 videosize
// - value 00 8个字节 "41","7d","94","47","30","00","00","00" 即 31016051
// 此时键值对 videosize: 31016051
array = ["76","69","64","65","6f","73","69","7a","65"]
array = ["41","7d","94","47","30","00","00","00"]
//- key 00 09 9个字节 即 framerate
// -value 00 8个字节 "40","37","fd","8a","bb","46","63","fd" 即 23.990398125348282  24
// 此时键值对 framerate: 24
array = ["66","72","61","6d","65","72","61","74","65"]
array = ["40","37","fd","8a","bb","46","63","fd"]
// -key 00 0d 13个字节 即 videodatarate
// -value 00 8个字节 "40","92","00","23","6c","85","24","20" 即 1152.0345936587619  1152
// 此时键值对 videodatarate: 1152
array = ["76","69","64","65","6f","64","61","74","61","72",
"61","74","65"]
array = ["40","92","00","23","6c","85","24","20" ]
// -key 00 0c 12个字节 即 videocodecid
// -value 00 8个字节 "40","1c","00","00","00","00","00","00" 即 7
// 此时键值对 videocodecid: 7
array = ["76","69","64","65","6f","63","6f","64","65","63",
"69","64"]
array = ["40","1c","00","00","00","00","00","00"]
// -key 00 05 5个字节 即 width
// -value 00 8个字节 "40","94","00","00","00","00","00","00" 即 1280
// 此时键值对 width: 1280
array = ["40","94","00","00","00","00","00","00"]
// -key 00 06 6个字节 即 height
// -value 00 8个字节 "40","86","80","00","00","00","00","00" 即 720
// 此时键值对 height: 720
array = ["40","86","80","00","00","00","00","00"]
// -key 00 09 9个字节 即 audiosize
// -value 00 8个字节 "41","4a","9e","7b","80","00","00","00" 即 3489015
// 此时键值对 audiosize: 3489015
array = ["61","75","64","69","6f","73","69","7a","65"]
array = ["41","4a","9e","7b","80","00","00","00"]
// -key 00 0d 13个字节 即 audiodatarate
// -value 00 8个字节 "40","5f","6c","3c","97","be","ba","a1" 即 125.69119828821069 125.7 
// 此时键值对 audiodatarate: 125.7 
array = ["61","75","64","69","6f","64","61","74","61","72",
"61","74","65"]
array = ["40","5f","6c","3c","97","be","ba","a1"]
// -key 00 0c 12个字节 即 audiocodecid
// -value 00 8个字节 "40","24","00","00","00","00","00","00" 即 10
// 此时键值对 audiocodecid: 10
array = ["61","75","64","69","6f","63","6f","64","65","63",
"69","64"]
array = ["40","24","00","00","00","00","00","00"]
// -key 00 0f 15个字节 即 audiosamplerate
// -value 00 8个字节 "40","08","00","00","00","00","00","00" 即 3
// 此时键值对 audiosamplerate: 3
array = ["61","75","64","69","6f","73","61","6d","70","6c",
"65","72","61","74","65"]
array = ["40","08","00","00","00","00","00","00"]
// -key 00 0f 15个字节 即 audiosamplesize
// -value 00 8个字节 "3f","f0","00","00","00","00","00","00" 即 1
// 此时键值对 audiosamplesize: 1
array = ["61","75","64","69","6f","73","61","6d","70","6c",
"65","73","69","7a","65"]
array = ["3f","f0","00","00","00","00","00","00"]
// -key 00 06 6个字节 即 stereo
// -value 01 01 即 true
// 此时键值对为 stereo: true
array = ["73","74","65","72","65","6f"]
// -key 00 08 8个字节 即 filesize
// -value 00 8个字节 "41","80","7b","81","78","00","00","00" 即 34566191
// 此时键值对为 filesize: 34566191
array = ["66","69","6c","65","73","69","7a","65"]
array = ["41","80","7b","81","78","00","00","00"]
// -key 00 0d 13个字节 即 lasttimestamp
// -value 00 8个字节 "40","6a","3e","b0","20","c4","9b","a6" 即 210
// 此时键值对为 lasttimestamp: 210
array = ["6c","61","73","74","74","69","6d","65","73","74",
"61","6d","70"]
array = ["40","6a","3e","b0","20","c4","9b","a6"]
// -key 00 15 21个字节 即 lastkeyframetimestamp
// -value 00 8个字节 "40","6a","3e","b0","20","c4","9b","a6" 即 210
array = ["6c","61","73","74","6b","65","79","66","72","61",
"6d","65","74","69","6d","65","73","74","61","6d",
"70"]
// 此时键值对为 lastkeyframetimestamp: 210
// -key 00 14 20个字节 即 lastkeyframelocation
// -value 00 8个字节 "41","80","7b","80","d8","00","00","00" 41807b80d8000000 34566171
array = ["6c","61","73","74","6b","65","79","66","72","61",
"6d","65","6c","6f","63","61","74","69","6f","6e"]
// -key 00 09 9个字节 即 keyframes
// -value 
array = ["6b","65","79","66","72","61","6d","65","73"]
array = ["66","69","6c","65","70","6f","73","69","74","69",
"6f","6e","73"]

array = ["0a","00","00","00","35"]
// console.log(data_string(array))
array = ["00","00","06","20"]
array = ["00","00","09",'35']
// console.log(hex_to_ten_array(array))
console.log(data_string(array))





